#ifndef _VISUAL_H
#define _VISUAL_H

#include <stdio.h>
#include "visual.h"

#define KURO 30 //eg J 9  (3,4,Q,10)さきに１０だすとひだりにでてしまう
#define AKA 31

 char *suto[5]={"\x1b[47;37m ","\x1b[47;30m♣","\x1b[47;30m♠","\x1b[47;31m♦","\x1b[47;31m♥",}; //マーク分け
    int co[4]={0};
    char *kara={"\x1b[47;37m "};
    char *change[4][13]={0};//文字列を入れるため
    int serach_mark[4]={0};
    int serach_number[4]={0};//四つの数字を覚えて代入する関数
    int kioku[4][13]={0};//カード表示用
    int color[2]={KURO,AKA};
    const char*num_up[14]={"  ","A ","2 ","3 ","4 ","5 ","6 ","7 ","8 ","9 ","10","J ","Q ","K "};
    const char*num_down[14]={"  "," A"," 2"," 3"," 4"," 5"," 6"," 7"," 8"," 9","10"," J"," Q"," K"};
    int hyoji[13][13]={
                {0,0,0,0,0,0,1,0,0,0,0,0,0},
                {0,0,0,1,0,0,0,0,0,1,0,0,0},
                {0,0,0,1,0,0,1,0,0,1,0,0,0},
                {1,1,0,0,0,0,0,0,0,0,0,1,1},
                {1,1,0,0,0,0,1,0,0,0,0,1,1},
                {1,1,0,0,0,1,0,1,0,0,0,1,1},
                {1,1,0,0,0,1,1,1,0,0,0,1,1},
                {1,1,0,1,0,1,0,1,0,1,0,1,1},
                {0,0,1,1,1,1,1,1,1,1,1,0,0},
                {1,1,1,0,1,1,0,1,1,0,1,1,1},//デザイン問題
                {1,1,1,0,1,1,1,1,1,0,1,1,1},
                {1,1,1,1,1,1,0,1,1,1,1,1,1},
                {1,1,1,1,1,1,1,1,1,1,1,1,1},
            };//nullの場合すべてkiokuが0になるから

#endif